"""
Реалізуйте алгоритм пошуку номеру останнього входження до заданого масиву заданого числа x.
Якщо заданий елемент відсутній у списку - поверніть номер останнього елементу, що менший за число x.
                            array[i] <= x
"""

def bsearch_rightmost(array, x):
    """ Бінарний пошук для відшукання останнього входження заданого числа
    :param array: Відсортований за неспаданням масив цілих чисел
    :param x:     Шукане число
    :return:      Номер шуканого елемента у масиві
    """
    left = 0
    right = len(array)
    while left < right:
        m = left + (right - left) // 2
        if array[m] <= x:
            left = m + 1
        else:
            right = m
    return left - 1



lst = [11, 11, 22, 33, 44]
print(bsearch_rightmost(lst, 11))